octopusconsortium/src/test/resources/messages/pds/getPatientDetailsResponse.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" >
   <soapenv:Header>
   		<To xmlns="http://www.w3.org/2005/08/addressing">https://q-builder:81/getPatientDetails/?wsdl</To> 
        <Action xmlns="http://www.w3.org/2005/08/addressing">urn:nhs-itk:services:201005:getPatientDetails-v1-0</Action> 
        <ReplyTo xmlns="http://www.w3.org/2005/08/addressing"> 
            <Address>http://www.w3.org/2005/08/addressing/anonymous</Address> 
        </ReplyTo> 
        <MessageID xmlns="http://www.w3.org/2005/08/addressing">9BA90954-9DC5-11E1-97FC-A3808CF43D41</MessageID>   
   </soapenv:Header>
   <soapenv:Body>
	<DistributionEnvelope xmlns="urn:nhs-itk:ns:201005">
		<header service="urn:nhs-itk:interaction:getPatientDetailsRequest-v1-0" trackingid="44BA94FA-FDB2-11E1-A8E0-737E5148DF39">
			<auditIdentity>
				<id uri="urn:nhs-uk:identity:ods:5L399"/>
			</auditIdentity>
			 <manifest count="1">
				<manifestitem id="uuid_44BA94F9-FDB2-11E1-A8E0-737E5148DF39" mimetype="text/xml" profileid="urn:nhs-en:profile:getPatientDetailsRequest-v1-0"/>
			</manifest>
		</header>
		<payloads count="1">
			<payload id="uuid_44BA94F9-FDB2-11E1-A8E0-737E5148DF39">
				<getPatientDetailsResponse-v1-0 xmlns="urn:hl7-org:v3" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="urn:hl7-org:v3 ../../Schemas/COMT_MT000016GB01.xsd" moodCode="EVN" classCode="OBS">
					<id root="4E25ACE2-23F8-4A37-B446-6A37F31BF76C"/>
					<code codeSystem="2.16.840.1.113883.2.1.3.2.4.17.284" code="getPatientDetailsResponse-v1-0"/>
					<value codeSystem="2.16.840.1.113883.2.1.3.2.4.17.285" code="SMSP-0000"/>
					<subject typeCode="SBJ">
						<patient classCode="PAT">
							<id root="2.16.840.1.113883.2.1.4.1" extension="9999345201"/>
							<name>
								<given>Pauline</given>
								<family>Roberts</family>
							</name>
							<addr use="H">
								<postalCode>LA12 7HG</postalCode>
								<streetAddressLine>41 Manor Grove</streetAddressLine>
								<streetAddressLine>Little Manorton</streetAddressLine>
								<streetAddressLine>Leeds</streetAddressLine>
								<streetAddressLine/>
								<streetAddressLine/>
							</addr>
							<patientPerson determinerCode="INSTANCE" classCode="PSN">
								<administrativeGenderCode code="1" codeSystem="2.16.840.1.113883.2.1.3.2.4.16.25"/>
								<birthTime value="19720919"/>
								<gPPractice classCode="SDLOC">
									<addr>
										<postalCode>LS17 8TY</postalCode>
										<streetAddressLine>2 High Street</streetAddressLine>
										<streetAddressLine>Little Manorton</streetAddressLine>
										<streetAddressLine>Leeds</streetAddressLine>
										<streetAddressLine/>
										<streetAddressLine/>
									</addr>
									<locationOrganization determinerCode="INSTANCE" classCode="ORG">
										<id root="2.16.840.1.113883.2.1.3.2.4.19.2" extension="YT4"/>
										<name>Grove GP Surgery</name>
									</locationOrganization>
								</gPPractice>
							</patientPerson>
						</patient>		
					</subject>
				</getPatientDetailsResponse-v1-0>
			</payload>
		</payloads>
	</DistributionEnvelope>
   </soapenv:Body>
</soapenv:Envelope>